In [ ]:
data.loc['two'],['Colorado','Utah']

In [5]:
# Introduction to Pandas Data Structures (Series)

In [6]:
import pandas as pd

In [7]:
obj = pd.Series([4,7,-5,3])

In [8]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [14]:
obj2['a']

-5

In [16]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [17]:
obj2[obj2 > 2]

d    4
b    7
c    3
dtype: int64

In [18]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [20]:
import numpy as np

In [21]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [22]:
'b' in obj2

True

In [23]:
'e' in obj2

False

In [24]:
sdata = {'Ohio':3500, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [25]:
sdata

{'Ohio': 3500, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [26]:
obj3 = pd.Series(sdata)

In [27]:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
states = ['California', 'Ohio', 'Oregon','Texas']

In [32]:
obj4 = pd.Series(sdata,index=states)

In [33]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [35]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [36]:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [38]:
obj3 + obj4

California         NaN
Ohio            7000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [39]:
obj4.name = 'population'

In [40]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [41]:
obj4.index.name = 'state'

In [42]:
obj4

state
California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [43]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [44]:
obj.index = ['Bob','Steve', 'Jeff', 'Ryan']

In [45]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [48]:
#DataFrame: Represents a rectangular table of data and contains an ordered collection of columns, each of which can be  a different value type. The DataFrame has both a row and column index, it can be thought of as a dict of Series all sharing the same index. Under the hood, the data is stored as one or more two- dimensional blocls rather than a list, dict, or some other collection of one-dimensional array.

In [49]:
data = {'states': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

frame = pd.DataFrame(data)

In [50]:
data

{'states': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [51]:
frame

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [52]:
frame.head()

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [56]:
pd.DataFrame(data, columns=['year','states','pop'])

   year  states  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [57]:
frame2 = pd.DataFrame(data,columns=['year','states','pop','debt'],
                        index=['one','two','three','four','five','six'])

In [58]:
frame2

       year  states  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [59]:
frame2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [64]:
frame2.states

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: states, dtype: object

In [62]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [63]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [65]:
frame2.loc['three']

year      2002
states    Ohio
pop        3.6
debt       NaN
Name: three, dtype: object

In [66]:
#Asigning scalar value to 'debt' column

In [67]:
frame2['debt']= 16.5

In [68]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [69]:
frame2['debt'] = np.arange(6.)

In [70]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [72]:
# The value's length must match the lenght of the DataFrame. The missing values will be labeled as Missing Values.

In [73]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])

In [74]:
frame2['debt'] = val

In [75]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [76]:
# Asigning a column that doesn't exist will create a new column. The del keyword will delete columns as with a dict.

In [78]:
frame2['eastern'] = frame.states == 'Ohio'

In [79]:
frame2

       year  states  pop  debt eastern
one    2000    Ohio  1.5   NaN     NaN
two    2001    Ohio  1.7  -1.2     NaN
three  2002    Ohio  3.6   NaN     NaN
four   2001  Nevada  2.4  -1.5     NaN
five   2002  Nevada  2.9  -1.7     NaN
six    2003  Nevada  3.2   NaN     NaN

In [80]:
del frame2['eastern']

In [81]:
frame2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [82]:
frame2

       year  states  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [83]:
# Another form of data is a nested dict or dicts:

In [84]:
pop = {'Nevada': {2001:2.4, 2004:2.9},
        'Ohio': {2000:1.5, 2001:1.7, 2002: 3.6}}

In [85]:
frame3 = pd.DataFrame(pop)

In [86]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2004     2.9   NaN
2000     NaN   1.5
2002     NaN   3.6

In [87]:
# Transpose Data

In [88]:
frame3.T

        2001  2004  2000  2002
Nevada   2.4   2.9   NaN   NaN
Ohio     1.7   NaN   1.5   3.6

In [89]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     NaN   3.6
2003     NaN   NaN

In [90]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [92]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2004   NaN     2.9

In [93]:
frame3.index.name = 'year'; frame3.columns.name = 'states'

In [94]:
frame3

states  Nevada  Ohio
year
2001       2.4   1.7
2004       2.9   NaN
2000       NaN   1.5
2002       NaN   3.6

In [95]:
frame3.values

array([[2.4, 1.7],
       [2.9, nan],
       [nan, 1.5],
       [nan, 3.6]])

In [96]:
#Index Objects

In [97]:
obj = pd.Series(range(3), index=['a','b','c'])

In [98]:
obj

a    0
b    1
c    2
dtype: int64

In [99]:
index = obj.index

In [100]:
index

Index(['a', 'b', 'c'], dtype='object')

In [101]:
index[1:]

Index(['b', 'c'], dtype='object')

In [105]:
index[1]

'b'

In [106]:
labels = pd.Index(np.arange(3))

In [107]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [117]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [118]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [119]:
obj2.index is labels

True

In [120]:
frame3

states  Nevada  Ohio
year
2001       2.4   1.7
2004       2.9   NaN
2000       NaN   1.5
2002       NaN   3.6

In [121]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='states')

In [122]:
'Ohio' in frame3.columns

True

In [123]:
2003 in frame3.index

False

In [124]:
#Pandas index can contain duplicate labels

In [127]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [128]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [129]:
#Essential Functionality

In [130]:
#Reindexing

In [131]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [132]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [136]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [137]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [138]:
obj3 = pd.Series(['Blue','purple','yellow'], index=[0,2,4])

In [139]:
obj3

0      Blue
2    purple
4    yellow
dtype: object

In [143]:
obj3.reindex(range(6),method='ffill')

0      Blue
1      Blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [144]:
#Alter row/column or both

In [147]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                      index=['a','c','d'],
                      columns=['Ohio','Texas','California'])

In [148]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [149]:
frame2 = frame.reindex(['a','b','c','d'])

In [150]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [151]:
#The columns can be reindexed with the columns keyword

In [152]:
states = ['Texas','Utah','California']

In [153]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [155]:
#Dropping Entries from an Axis

In [156]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])

In [157]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [158]:
new_obj = obj.drop('c')

In [159]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [161]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [162]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [163]:
# With DataFrame , index can be deleted form either axis.

In [181]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index=['Ohio','Colorado','Utah','NY'],
                      columns=['one','two','three','four'])

In [182]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [183]:
data.drop(['Colorado','Ohio'])

      one  two  three  four
Utah    8    9     10    11
NY     12   13     14    15

In [184]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NY         12     14    15

In [185]:
data.drop(['two','four'], axis= 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
NY         12     14

In [186]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [187]:
obj.drop('c', inplace=True)

In [188]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [190]:
#Indexing, Selecting and Filtering

In [191]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [192]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [193]:
obj['b':'c'] = 5

In [194]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [205]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['Ohio','Colorado','Utah','NY'],
                  columns=['one','two','three','four'])

In [206]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [207]:
data['two']

Ohio         1
Colorado     5
Utah         9
NY          13
Name: two, dtype: int32

In [209]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
NY           14   12

In [210]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [211]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [212]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
NY        False  False  False  False

In [213]:
data[data < 5] = 0

In [214]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [215]:
#Selection with Loc and iloc

In [218]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [221]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32